app/controllers/short_urls_controller.rb

  def index
    @urls = ShortUrl.all.order('click_count DESC').limit(100)
---
SELECT `short_urls`.* FROM `short_urls` ORDER BY click_count DESC LIMIT 100

  def create
    @short_url = ShortUrl.new(create_params)

    if @short_url.save
---
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://www.google.com', '2021-12-14 07:06:13.950033', '2021-12-14 07:06:13.950033')

  def show
    if @short_url.update!(click_count: @short_url.click_count + 1)
---
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2021-12-14 07:10:57.821590' WHERE `short_urls`.`id` = 1