app/jobs/update_title_job.rb

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 1 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`title` = 'Google', `short_urls`.`updated_at` = '2021-12-14 07:06:18.946226' WHERE `short_urls`.`id` = 1
---
  def perform(short_url_id)
    @short_url = ShortUrl.find(short_url_id)

    # open the HTML DOC
    doc = Nokogiri::HTML(URI.open(@short_url.full_url))
    title = doc.at_css('title').text
    @short_url.update!(title: title)